Revit 2026 API

# ElectricalSystemPowerFactorState Property

---

The PowerFactorState type of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PowerFactorStateType PowerFactorState { get; }
```
```vb
Public ReadOnly Property PowerFactorState As PowerFactorStateType
	Get
```
```cpp
public:
property PowerFactorStateType PowerFactorState {
	PowerFactorStateType get ();
}
```
```fsharp
member PowerFactorState : PowerFactorStateType with get
```

#### Property Value

PowerFactorStateType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the PowerFactorState type of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace